modm-ext/archive-stmicro-svd/rm_rm0090_stm32f405oey6.svd
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>FMR</name>
        <addressOffset>0x200</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FINIT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CAN2SB</name>
          <bitOffset>8</bitOffset>
          <bitWidth>6</bitWidth>
        </field>
      </fields>
      <register>
        <name>FM1R</name>
        <addressOffset>0x204</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FBM</name>
          <bitOffset>0</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
      </fields>
      <register>
        <name>FS1R</name>
        <addressOffset>0x20c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FSC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
      </fields>
      <register>
        <name>FFA1R</name>
        <addressOffset>0x214</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FFA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
      </fields>
      <register>
        <name>FA1R</name>
        <addressOffset>0x21c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FACT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
      </fields>
      <register>
        <name>F0R1</name>
        <addressOffset>0x240</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F0R2</name>
        <addressOffset>0x244</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F1R1</name>
        <addressOffset>0x248</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F1R2</name>
        <addressOffset>0x24c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F27R1</name>
        <addressOffset>0x318</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>F27R2</name>
        <addressOffset>0x31c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FB</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>CAN2</name>
      <baseAddress>0x40006800</baseAddress>
      <register>
        <name>MCR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SLEEP</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFP</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RFLM</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NART</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWUM</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ABOM</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TTCM</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RESET</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBF</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>MSR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INAK</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SLAK</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ERRI</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WKUI</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SLAKI</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>5</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>TXM</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RXM</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SAMP</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RX</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>TSR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RQCP0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXOK0</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ALST0</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TERR0</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>4</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>ABRQ0</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RQCP1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXOK1</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ALST1</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TERR1</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ABRQ1</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RQCP2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXOK2</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ALST2</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TERR2</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ABRQ2</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CODE</name>
          <bitOffset>24</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>TME</name>
          <bitOffset>26</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>LOW</name>
          <bitOffset>29</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>RF0R</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FMP0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FULL0</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FOVR0</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RFOM0</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>RF1R</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>FMP1</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FULL1</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FOVR1</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RFOM1</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>IER</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TMEIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FMPIE0</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FFIE0</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FOVIE0</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FMPIE1</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FFIE1</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FOVIE1</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EWGIE</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPVIE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BOFIE</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LECIE</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>12</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>ERRIE</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>WKUIE</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SLKIE</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>ESR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EWGF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EPVF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BOFF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>LEC</name>
          <bitOffset>4</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>TEC</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>REC</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>BTR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BRP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>TS1</name>
          <bitOffset>16</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TS2</name>
          <bitOffset>20</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>SJW</name>
          <bitOffset>24</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>LBKM</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SILM</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>TI0R</name>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TXRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDT0R</name>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DLC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TGT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIME</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDL0R</name>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA3</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDH0R</name>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TI1R</name>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TXRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDT1R</name>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DLC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TGT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIME</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDL1R</name>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA3</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDH1R</name>
        <addressOffset>0x19c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TI2R</name>
        <addressOffset>0x1a0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TXRQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDT2R</name>
        <addressOffset>0x1a4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DLC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>TGT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TIME</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDL2R</name>
        <addressOffset>0x1a8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA1</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA2</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA3</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>TDH2R</name>
        <addressOffset>0x1ac</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DATA4</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA5</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA6</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>DATA7</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>RI0R</name>
        <addressOffset>0x1b0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EXID</name>
          <bitOffset>3</bitOffset>
          <bitWidth>18</bitWidth>
        </field>
        <field>
          <name>STID/EXID</name>
          <bitOffset>21</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
      </fields>
      <register>
        <name>RDT0R</name>
        <addressOffset>0x1b4</addressOffset>
        <size>0x20</size>
      </register>
