modm-ext/archive-stmicro-svd/rm_rm0090_stm32f405oey6.svd
      <fields>
        <field>
          <name>TSUSS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>31</bitWidth>
        </field>
        <field>
          <name>TSUPNS</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>PTPTSAR</name>
        <addressOffset>0x718</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TSA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>PTPTTHR</name>
        <addressOffset>0x71c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TTSH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>PTPTTLR</name>
        <addressOffset>0x720</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TTSL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>PTPTSSR</name>
        <addressOffset>0x728</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TSSO</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSTTR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>PTPPPSCR</name>
        <addressOffset>0x72c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>PPSFREQ</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMABMR</name>
        <addressOffset>0x1000</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DA</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DSL</name>
          <bitOffset>2</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>EDFE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PBL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>6</bitWidth>
        </field>
        <field>
          <name>PM</name>
          <bitOffset>14</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FB</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RDP</name>
          <bitOffset>17</bitOffset>
          <bitWidth>6</bitWidth>
        </field>
        <field>
          <name>USP</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FPM</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AAB</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MB</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMATPDR</name>
        <addressOffset>0x1004</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TPD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMARPDR</name>
        <addressOffset>0x1008</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RPD</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMARDLAR</name>
        <addressOffset>0x100c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SRL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMATDLAR</name>
        <addressOffset>0x1010</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>STL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMASR</name>
        <addressOffset>0x1014</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TPSS</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TBUS</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TJTS</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ROS</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TUS</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RS</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RBUS</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RPSS</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RWTS</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ETS</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FBES</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ERS</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AIS</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NIS</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RPS</name>
          <bitOffset>17</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>TPS</name>
          <bitOffset>20</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>EBS</name>
          <bitOffset>23</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>MMCS</name>
          <bitOffset>27</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PMTS</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSTS</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMAOMR</name>
        <addressOffset>0x1018</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SR</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OSF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RTC</name>
          <bitOffset>3</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>FUGF</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FEF</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ST</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TTC</name>
          <bitOffset>14</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>FTF</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSF</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DFRF</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RSF</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DTCEFD</name>
          <bitOffset>26</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMAIER</name>
        <addressOffset>0x101c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TPSIE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TBUIE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TJTIE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ROIE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TUIE</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RIE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RBUIE</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RPSIE</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RWTIE</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ETIE</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FBEIE</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ERIE</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AISE</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>NISE</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMAMFBOCR</name>
        <addressOffset>0x1020</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MFC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>OMFC</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>MFA</name>
          <bitOffset>17</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>OFOC</name>
          <bitOffset>28</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMARSWTR</name>
        <addressOffset>0x1024</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RSWTC</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMACHTDR</name>
        <addressOffset>0x1048</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HTDAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMACHRDR</name>
        <addressOffset>0x104c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HRDAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMACHTBAR</name>
        <addressOffset>0x1050</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HTBAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>DMACHRBAR</name>
        <addressOffset>0x1054</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>HRBAP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <baseAddress>0x4002b000</baseAddress>
      <register>
        <name>CR</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>ISR</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>IFCR</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGMAR</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGOR</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGMAR</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGOR</name>
        <addressOffset>0x18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGPFCCR</name>
        <addressOffset>0x1c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>s</name>
          <bitOffset>6</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>FGCOLR</name>
        <addressOffset>0x20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGPFCCR</name>
        <addressOffset>0x24</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>s</name>
          <bitOffset>6</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>BGCOLR</name>
        <addressOffset>0x28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCMAR</name>
        <addressOffset>0x2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCMAR</name>
        <addressOffset>0x30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>OPFCCR</name>
        <addressOffset>0x34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>OCOLR</name>
        <addressOffset>0x38</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BLUE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>GREEN</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>RED</name>
          <bitOffset>8</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>ALPHA</name>
          <bitOffset>12</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
      </fields>
      <register>
        <name>OMAR</name>
        <addressOffset>0x3c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>MA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
      </fields>
      <register>
        <name>OOR</name>
        <addressOffset>0x40</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>LO</name>
          <bitOffset>0</bitOffset>
          <bitWidth>14</bitWidth>
        </field>
      </fields>
      <register>
        <name>NLR</name>
        <addressOffset>0x44</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>NL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>PL</name>
          <bitOffset>16</bitOffset>
          <bitWidth>14</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>30</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>LWR</name>
        <addressOffset>0x48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>AMTCR</name>
        <addressOffset>0x4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.0</name>
        <addressOffset>0x400</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.1</name>
        <addressOffset>0x404</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.2</name>
        <addressOffset>0x408</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.3</name>
        <addressOffset>0x40c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.4</name>
        <addressOffset>0x410</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.5</name>
        <addressOffset>0x414</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.6</name>
        <addressOffset>0x418</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.7</name>
        <addressOffset>0x41c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.8</name>
        <addressOffset>0x420</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.9</name>
        <addressOffset>0x424</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.10</name>
        <addressOffset>0x428</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.11</name>
        <addressOffset>0x42c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.12</name>
        <addressOffset>0x430</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.13</name>
        <addressOffset>0x434</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.14</name>
        <addressOffset>0x438</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.15</name>
        <addressOffset>0x43c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.16</name>
        <addressOffset>0x440</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.17</name>
        <addressOffset>0x444</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.18</name>
        <addressOffset>0x448</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.19</name>
        <addressOffset>0x44c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.20</name>
        <addressOffset>0x450</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.21</name>
        <addressOffset>0x454</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.22</name>
        <addressOffset>0x458</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.23</name>
        <addressOffset>0x45c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.24</name>
        <addressOffset>0x460</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.25</name>
        <addressOffset>0x464</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.26</name>
        <addressOffset>0x468</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.27</name>
        <addressOffset>0x46c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.28</name>
        <addressOffset>0x470</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.29</name>
        <addressOffset>0x474</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.30</name>
        <addressOffset>0x478</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.31</name>
        <addressOffset>0x47c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.32</name>
        <addressOffset>0x480</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.33</name>
        <addressOffset>0x484</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.34</name>
        <addressOffset>0x488</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.35</name>
        <addressOffset>0x48c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.36</name>
        <addressOffset>0x490</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.37</name>
        <addressOffset>0x494</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.38</name>
        <addressOffset>0x498</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.39</name>
        <addressOffset>0x49c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.40</name>
        <addressOffset>0x4a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.41</name>
        <addressOffset>0x4a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>FGCLUT.42</name>
        <addressOffset>0x4a8</addressOffset>
        <size>0x20</size>
      </register>
